import { motion } from 'framer-motion';
import { AppUrl } from '../../const';
import { Link, useLocation } from 'react-router-dom';

const Contacts = () => {
  const { pathname } = useLocation();

  const isMainPage = pathname === AppUrl.Main;

  return (
    <motion.aside
      key='contacts'
      className='contacts'
      initial={false}
      variants={{
        close: { y: 333 },
        open: {
          y: 0,
          transition: {
            type: 'tween',
            delay: 1.2,
          },
        },
      }}
      animate={isMainPage ? 'close' : 'open'}
    >
      <h2 className='contacts__title'>Контакты</h2>
      <ul className='contacts__list'>
        <li>
          <Link
            to={'https://t.me/mirael26'}
            className='contacts__link contacts__link--telegram'
            target='_blank'
          >
            <svg
              width='40'
              height='40'
              viewBox='0 0 40 40'
              fill='none'
              xmlns='http://www.w3.org/2000/svg'
              aria-label='Telegram'
            >
              <path
                fill-rule='evenodd'
                clip-rule='evenodd'
                d='M40 20C40 31.0457 31.0457 40 20 40C8.95431 40 0 31.0457 0 20C0 8.95431 8.95431 0 20 0C31.0457 0 40 8.95431 40 20ZM20.6994 14.7544C18.751 15.5704 14.8709 17.2523 9.0424 19.7836C8.10984 20.1666 7.61026 20.5329 7.5603 20.8993C7.48655 21.5188 8.26195 21.7594 9.30796 22.084C9.44293 22.1259 9.58242 22.1692 9.72516 22.2149C10.7576 22.5479 12.1232 22.9309 12.8392 22.9476C13.4887 22.9642 14.2048 22.6978 15.0041 22.1483C20.4496 18.468 23.2472 16.6029 23.4304 16.5696C23.5636 16.5363 23.7302 16.503 23.8467 16.6029C23.9633 16.7028 23.9633 16.9026 23.9466 16.9526C23.8672 17.2836 20.6185 20.2995 19.1402 21.672C18.7593 22.0255 18.496 22.27 18.4346 22.3314C18.2784 22.4922 18.1194 22.6444 17.9664 22.7908C17.0106 23.7057 16.2932 24.3923 18.0016 25.5121C18.7782 26.0249 19.4047 26.4522 20.0215 26.8731C20.7671 27.3817 21.4986 27.8809 22.4645 28.5096C22.6921 28.6591 22.91 28.8141 23.1225 28.9653C23.9521 29.5554 24.7006 30.0879 25.6286 30.0084C26.1615 29.9584 26.711 29.4588 26.9941 27.9601C27.6602 24.4297 28.9591 16.7528 29.2589 13.5887C29.2922 13.3223 29.2589 12.9726 29.2256 12.806C29.1923 12.6395 29.1423 12.423 28.9425 12.2565C28.6927 12.0567 28.3263 12.0234 28.1598 12.0234C27.4104 12.04 26.2447 12.4397 20.6994 14.7544Z'
              />
            </svg>
          </Link>
        </li>
        <li>
          <Link
            to={'https://vk.com/mirael26'}
            className='contacts__link contacts__link--vk'
            target='_blank'
          >
            <svg
              width='40'
              height='40'
              viewBox='0 0 40 40'
              fill='none'
              xmlns='http://www.w3.org/2000/svg'
              aria-label='Вконтакте'
            >
              <path
                fill-rule='evenodd'
                clip-rule='evenodd'
                d='M2.81177 2.81177C0 5.62355 0 10.149 0 19.2V20.8C0 29.851 0 34.3765 2.81177 37.1882C5.62355 40 10.149 40 19.2 40H20.8C29.851 40 34.3765 40 37.1882 37.1882C40 34.3765 40 29.851 40 20.8V19.2C40 10.149 40 5.62355 37.1882 2.81177C34.3765 0 29.851 0 20.8 0H19.2C10.149 0 5.62355 0 2.81177 2.81177ZM6.75006 12.1667C6.96673 22.5667 12.1667 28.8167 21.2833 28.8167H21.8001V22.8667C25.1501 23.2001 27.6833 25.6501 28.6999 28.8167H33.4334C32.1334 24.0834 28.7166 21.4667 26.5832 20.4667C28.7166 19.2334 31.7166 16.2334 32.4332 12.1667H28.1331C27.1998 15.4667 24.4334 18.4667 21.8001 18.7501V12.1667H17.5V23.7001C14.8333 23.0334 11.4667 19.8001 11.3167 12.1667H6.75006Z'
              />
            </svg>
          </Link>
        </li>
      </ul>
      <p className='contacts__text'>Почта: capricorn_26@mail.ru</p>
    </motion.aside>
  );
};

export default Contacts;
